---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyWallPanelsWarn
source: html/3bf6e4f4-547c-40b6-acc3-63345f65536d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyWallPanelsWarn Property

Cannot copy wall panels unless their parent wall is also being copied.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyWallPanelsWarn { get; }
```